Revit 2026 API

# InternalDefinition Class

---

This object represents a parameter definition in an Autodesk Revit model.

SystemObject Autodesk.Revit.DBDefinition Autodesk.Revit.DBInternalDefinition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InternalDefinition : Definition,
	IDisposable
```
```vb
Public Class InternalDefinition
	Inherits Definition
	Implements IDisposable
```
```cpp
public ref class InternalDefinition : public Definition,
	IDisposable
```
```fsharp
type InternalDefinition =
    class
        inherit Definition
        interface IDisposable
    end
```

The InternalDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BuiltInParameter | Tests whether this definition identifies a built-in parameter or not. |
|  | Id | The id of the parameter. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The user-visible name for the parameter.(Overrides DefinitionName) |
|  | VariesAcrossGroups | Whether or not the parameter values can vary across group members. |
|  | Visible | Indicates if the parameter is visible in the Autodesk Revit user interface. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the InternalDefinition |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. (Inherited from Definition) |
|  | GetGroupTypeId | Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs.(Overrides DefinitionGetGroupTypeId) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParameterTypeId | Tests whether this definition identifies a built-in parameter or not. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeId | Gets the identifier of the parameter. |
|  | SetAllowVaryBetweenGroups | Whether or not the parameter values can vary across group members. |
|  | SetGroupTypeId | Sets the built-in parameter group to which the parameter defined by this definition belongs. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace